#호선별 정보를 저장해보자

Normal = {
    "1호선_광명행": ["영등포","신도림","구로","가산디지털단지","독산","금천구청","광명"]
    "1호선 "
}
#1호선
uplane_one = {
    #상행:
    "소요산행": ["인천","동인천","도원","제물포","도화","주안","간석","동암","백운","부평","부개","송내","중동","부천","소사","역곡","온수","오류동","개봉","구일","구로","신도림","영등포","신길","대방","노량진","용산","남영","서울역","시청","종각","종로3가","종로5가","동대문","동묘앞","신설동","제기동","청량리","회기","외대앞","신이문","석계","광운대","월계","녹천","창동","방학","도봉","도봉산","망월사","회룡","의정부","가능","녹양","양주","덕계","덕정","지행","동두천중앙","보산","동두천","소요산"],

}
#상행: 
동두천행(101), 양주행(107), 의정부행(110), 광운대행(119), 청량리행(124), 동묘앞행(127), 서울역행(133), 용산행(135), 영등포행(139), 구로행(141), 병점행(P157), 천안행(P169)



하행: 광운대행(119), 서울역행(133), 구로행(141), 부천행(148), 부평행(152), 동인천행(160), 인천행(161), 광명행(P144-1), 병점행(P157), 서동탄행(P157-1), 천안행(P169), 신창행(P177)





2호선

상행: 외선순환, 을지로입구행(202), 성수행(211), 삼성행(219), 서울대입구행(228), 신도림행(234), 홍대입구행(239)



하행: 내선순환, 을지로입구행(202), 성수행(211), 신설동행(211-4), 삼성행(219), 서울대입구행(228), 신도림행(234), 까치산행(234-4), 홍대입구행(239)





# 3호선

# 상행: 대화행(309), 구파발행(320), 독립문행(326), 압구정행(336)



# 하행: 삼송행(318), 구파발행(320), 약수행(333), 도곡행(344), 수서행(349), 오금행(352)





# ​4호선 

# ​상행:​ 당고개행(409), 노원행(411), 한성대입구행(419), 사당행(433), 금정행(443), 안산행(453)



# 하행:​ 서울역행(426), 사당행(433), 산본행(444), 안산행(453), 오이도행(456)





​5호선 

상행:​ 방화행(510), 화곡행(517), 여의도행(526), 애오개행(530), 왕십리행(540), 군자행(544), 강동행(548)



하행:​ 여의도행(526), 애오개행(530), 왕십리행(540), 군자행(544), 상일동행(553), 하남검단산행(558), 마천행(P555)





​6호선 

상행:​ 응암순환행, 새절행(616), 대흥행(625), 공덕행(626), 한강진행(631), 안암행(639)



하행:​ 응암행(610), 대흥행(625), 공덕행(626), 한강진행(631), 안암행(639), 봉화산행(647), 신내행(648)





# ​7호선 

# ​상행:​ 장암행(709), 도봉산행(710), 수락산행(711), 태릉입구행(717), 건대입구행(727), 청담행(729), 내방행(735), 신풍행(743), 온수행(750)



# 하행:​ 건대입구행(727), 청담행(729), 내방행(735), 신풍행(743), 온수행(750), 부평구청행(759), 석남행(761)





# ​8호선 

# 상행:​ 암사행(810), 잠실행(814), 가락시장행(817)



# ​하행:​ 가락시장행(817), 모란행(827)





# ​9호선 

# ​상행:​ 개화행(901), 김포공항행(902), 마곡나루행(905), 가양행(907), 염창행(910), 당산행(913), 노량진행(917), 동작행(920), 신논현행(925), 삼전행(931)



# 하행:​ 가양행(907), 당산행(913), 동작행(920), 신논현행(925), 삼전행(931), 중앙보훈병원행(938)

# ​경의중앙선 

# 상행:​ 임진강행(K336), 문산행(K335), 일산행(K326), 대곡행(K322), 수색행(K317), 용산행(K110), 청량리행(K117)



# 하행:​ 문산행(K335), 서울역행(P313), 용산행(K110), 청량리행(K117), 덕소행(K126), 용문행(K137), 지평행(K138)

# 공항철도 

# 상행:​ 서울역행(A01), 디지털미디어시티행(A04)



# 하행:​ 검암행(A07), 인천공항2터미널행(A11)

​경춘선 

​상행:​ 청량리행(K117), 광운대행(119), 상봉행(K120), 평내호평행(P128)



하행:​ 평내호평행(P128), 마석행(P130), 춘천행(P140)

# 수인분당선 

# 상행:​ 청량리행(K209), 왕십리행(K210), 죽전행(K233), 고색행(K246), 오이도행(K258)



# 하행:​ 죽전행(K233), 고색행(K246), 오이도행(K258), 인천행(K272)

# 신분당선 

# 상행:​ 강남행(D07)



# 하행:​ 광교경기대행(D19)


# 우이신설선 

# 상행:​ 북한산우이행(S110)



# 하행:​ 신설동행(S122)
